---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeIterator.Dispose
source: html/6d1bf330-9ad0-ab93-0783-8be583406b25.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeIterator.Dispose Method

Releases all resources used by the DuctSizeIterator

## Syntax (C#)
```csharp
public void Dispose()
```